#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/subhasis020299/gh-actions-demo/runs/run-hSrv9rwUHrxLT7WW

Waiting for the plan to start...

Terraform v1.2.1
on linux_amd64
Initializing plugins and modules...
module.lambda_function.data.external.archive_prepare[0]: Reading...
module.lambda_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=3b350b04a0755294880232de57ee2e65a74d2bdf]
module.lambda_function.null_resource.archive[0]: Refreshing state... [id=8615889281882585661]
module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/TestLambdaPython]
module.lambda_function.data.aws_partition.current: Reading...
module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3693445097]
module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=TestLambdaPython]
module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=TestLambdaPython]
module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::302087542857:policy/TestLambdaPython-logs]
module.lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=TestLambdaPython-20220531063804900800000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.lambda_function.aws_cloudwatch_log_group.lambda[0] must be replaced
-/+ resource "aws_cloudwatch_log_group" "lambda" {
      ~ arn               = "arn:aws:logs:ap-south-1:302087542857:log-group:/aws/lambda/TestLambdaPython" -> (known after apply)
      ~ id                = "/aws/lambda/TestLambdaPython" -> (known after apply)
      ~ name              = "/aws/lambda/TestLambdaPython" -> "/aws/lambda/TopTenPosts" # forces replacement
        tags              = {
            "ManagedBy" = "Terraform"
        }
        # (2 unchanged attributes hidden)
    }

  # module.lambda_function.aws_iam_policy.logs[0] must be replaced
-/+ resource "aws_iam_policy" "logs" {
      ~ arn       = "arn:aws:iam::302087542857:policy/TestLambdaPython-logs" -> (known after apply)
      ~ id        = "arn:aws:iam::302087542857:policy/TestLambdaPython-logs" -> (known after apply)
      ~ name      = "TestLambdaPython-logs" -> "TopTenPosts-logs" # forces replacement
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ap-south-1:302087542857:log-group:/aws/lambda/TestLambdaPython:*:*",
                          - "arn:aws:logs:ap-south-1:302087542857:log-group:/aws/lambda/TestLambdaPython:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id = "ANPAUMVOSDBEUT3ZKDZPF" -> (known after apply)
        tags      = {
            "ManagedBy" = "Terraform"
        }
        # (2 unchanged attributes hidden)
    }

  # module.lambda_function.aws_iam_role.lambda[0] must be replaced
-/+ resource "aws_iam_role" "lambda" {
      ~ arn                   = "arn:aws:iam::302087542857:role/TestLambdaPython" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "lambda.amazonaws.com"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2022-05-31T06:38:03Z" -> (known after apply)
      ~ id                    = "TestLambdaPython" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::302087542857:policy/TestLambdaPython-logs",
        ] -> (known after apply)
      ~ name                  = "TestLambdaPython" -> "TopTenPosts" # forces replacement
      + name_prefix           = (known after apply)
        tags                  = {
            "ManagedBy" = "Terraform"
        }
      ~ unique_id             = "AROAUMVOSDBEZROLBIQ44" -> (known after apply)
        # (4 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.lambda_function.aws_iam_role_policy_attachment.logs[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "logs" {
      ~ id         = "TestLambdaPython-20220531063804900800000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::302087542857:policy/TestLambdaPython-logs" -> (known after apply) # forces replacement
      ~ role       = "TestLambdaPython" -> "TopTenPosts" # forces replacement
    }

  # module.lambda_function.aws_lambda_function.this[0] must be replaced
-/+ resource "aws_lambda_function" "this" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ap-south-1:302087542857:function:TestLambdaPython" -> (known after apply)
      ~ description                    = "Test Lambda function written in Python" -> "Python lambda function to fetch top 10 posts"
      ~ function_name                  = "TestLambdaPython" -> "TopTenPosts" # forces replacement
      ~ id                             = "TestLambdaPython" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:ap-south-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-south-1:302087542857:function:TestLambdaPython/invocations" -> (known after apply)
      ~ last_modified                  = "2022-05-31T06:46:53.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:ap-south-1:302087542857:function:TestLambdaPython:$LATEST" -> (known after apply)
      ~ role                           = "arn:aws:iam::302087542857:role/TestLambdaPython" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "WLDuUtUP8AwP9p/0FnHpWYP5K9YgBz5imcdnJa0MTWQ=" -> (known after apply)
      ~ source_code_size               = 596550 -> (known after apply)
        tags                           = {
            "ManagedBy" = "Terraform"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (9 unchanged attributes hidden)


      ~ tracing_config {
          ~ mode = "PassThrough" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # module.lambda_function.aws_lambda_function_url.this[0] will be created
  + resource "aws_lambda_function_url" "this" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "TopTenPosts"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + url_id             = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "8615889281882585661" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1653979552296248000" -> "1653980644089646200"
            # (1 unchanged element hidden)
        }
    }

Plan: 7 to add, 0 to change, 6 to destroy.

Changes to Outputs:
  + lambda_function_url = (known after apply)

```
</details>
*Pushed by: @subhasis020299, Action: `pull_request`*